Revit 2024 API
FailureDefinitionAccessor Class
 A class that provides access to the details of a FailureDefinition after the definition has been defined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class FailureDefinitionAccessor : IDisposable
Visual Basic
Public Class FailureDefinitionAccessor _
	Implements IDisposable
Visual C++
public ref class FailureDefinitionAccessor : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureDefinitionAccessor
See Also
FailureDefinitionAccessor Members
Autodesk.Revit.DB Namespace